# Task 6.1 Sourcing Open Data

In [1]:
### 1. Importing Libraries

In [1]:
# Import libraries
from downcast import reduce
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
# Path
path = r"C:\Users\Natalia\Documents\World University Rank"

In [3]:
# Import Happiness dataset
df = pd.read_csv(os.path.join(path, '02 Original Data', 'timesData.csv'), index_col = False)

In [4]:
df.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1.0,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011.0
1,1.0,California Institute of Technology,United States of America,95.7,56.0,98.2,99.9,97.0,94.8,"2,243",6.9,27%,33 : 67,2012.0
2,1.0,California Institute of Technology,United States of America,96.3,59.8,99.4,99.7,95.6,95.5,"2,243",6.9,27%,33 : 67,2013.0
3,1.0,California Institute of Technology,United States of America,94.4,65.8,98.2,99.8,91.2,94.9,"2,243",6.9,27%,33 : 67,2014.0
4,1.0,California Institute of Technology,United States of America,92.2,67.0,98.1,99.7,89.1,94.3,"2,243",6.9,27%,33 : 67,2015.0

In [6]:
df.shape

(2603, 14)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2603 entries, 0 to 2602
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   world_rank              2603 non-null   object
 1   university_name         2603 non-null   object
 2   country                 2603 non-null   object
 3   teaching                2603 non-null   float64
 4   international           2594 non-null   float64
 5   research                2603 non-null   float64
 6   citations               2603 non-null   float64
 7   income                  2385 non-null   float64
 8   total_score             1201 non-null   float64
 9   num_students            2544 non-null   object
 10  student_staff_ratio     2544 non-null   float64
 11  international_students  2536 non-null   object
 12  female_male_ratio       2367 non-null   object
 13  year                    2603 non-null   int64
dtypes: float64(7), int64(1), object(6)
memory usage: 284.8+ KB

In [8]:
df.describe()

,teaching,international,research,citations,income,total_score,student_staff_ratio,year
count,2603.000000,2594.000000,2603.000000,2603.000000,2385.000000,1201.000000,2544.000000,2603.000000
mean,37.801498,52.007440,35.910257,60.921629,48.979874,59.846128,18.445283,2014.075682
std,17.604218,22.103825,21.254805,23.073219,21.179938,12.803446,11.458698,1.685733
min,9.900000,7.100000,2.900000,1.200000,24.200000,41.400000,0.600000,2011.000000
25%,24.700000,33.425000,19.600000,45.500000,33.000000,50.300000,11.975000,2013.000000
50%,33.900000,50.300000,30.500000,62.500000,41.000000,56.000000,16.100000,2014.000000
75%,46.400000,69.000000,47.250000,79.050000,59.000000,66.200000,21.500000,2016.000000
max,99.700000,100.000000,99.400000,100.000000,100.000000,96.100000,162.600000,2016.000000

In [9]:
# Missing Value Check
df.isnull().sum()

world_rank                   0
university_name              0
country                      0
teaching                     0
international                9
research                     0
citations                    0
income                     218
total_score               1402
num_students                59
student_staff_ratio         59
international_students      67
female_male_ratio          236
year                         0
dtype: int64

In [10]:
df.columns

Index(['world_rank', 'university_name', 'country', 'teaching', 'international',
       'research', 'citations', 'income', 'total_score', 'num_students',
       'student_staff_ratio', 'international_students', 'female_male_ratio',
       'year'],
      dtype='object')

#### Duplicates found are essential for this csv document

In [11]:
# Check for any mixed-type columns
for col in df.columns.tolist():
  weird = (df[[col]].applymap(type) != df[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df[weird]) > 0:
    print (col)

num_students
international_students
female_male_ratio

In [12]:
df.dtypes

world_rank                 object
university_name            object
country                    object
teaching                  float64
international             float64
research                  float64
citations                 float64
income                    float64
total_score               float64
num_students               object
student_staff_ratio       float64
international_students     object
female_male_ratio          object
year                        int64
dtype: object

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2603 entries, 0 to 2602
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   world_rank              2603 non-null   object
 1   university_name         2603 non-null   object
 2   country                 2603 non-null   object
 3   teaching                2603 non-null   float64
 4   international           2594 non-null   float64
 5   research                2603 non-null   float64
 6   citations               2603 non-null   float64
 7   income                  2385 non-null   float64
 8   total_score             1201 non-null   float64
 9   num_students            2544 non-null   object
 10  student_staff_ratio     2544 non-null   float64
 11  international_students  2536 non-null   object
 12  female_male_ratio       2367 non-null   object
 13  year                    2603 non-null   int64
dtypes: float64(7), int64(1), object(6)
memory usage: 284.8+ KB

In [14]:
# Exporting Happiness 2018 ratings dataframe
df.to_pickle(os.path.join(path, 'Task 6.1', '03 Scripts', 'Time_list.pkl'))